# Snapshot report for `test/no-useless-interpolation.mjs`

The actual snapshot is saved in `no-useless-interpolation.mjs.snap`.

Generated by [AVA](https://avajs.dev).

## Invalid #1
      1 | `${foo}`

> Output

    `␊
      1 | String(foo)␊
    `

> Error 1/1

    `␊
    > 1 | \`${foo}\`␊
        |    ^^^ Do not use template literal only have one expression.␊
    `

## Invalid #2
      1 | `${"a" + 1}`

> Output

    `␊
      1 | "a" + 1␊
    `

> Error 1/1

    `␊
    > 1 | \`${"a" + 1}\`␊
        |    ^^^^^^^ Do not use template literal only have one expression.␊
    `

## Invalid #3
      1 | `${"a" + foo}`

> Output

    `␊
      1 | String("a" + foo)␊
    `

> Error 1/1

    `␊
    > 1 | \`${"a" + foo}\`␊
        |    ^^^^^^^^^ Do not use template literal only have one expression.␊
    `

## Invalid #4
      1 | `${String(foo)}`

> Output

    `␊
      1 | String(String(foo))␊
    `

> Error 1/1

    `␊
    > 1 | \`${String(foo)}\`␊
        |    ^^^^^^^^^^^ Do not use template literal only have one expression.␊
    `

## Invalid #5
      1 | const foo = ""; const bar = `${foo}`

> Output

    `␊
      1 | const foo = ""; const bar = foo␊
    `

> Error 1/1

    `␊
    > 1 | const foo = ""; const bar = \`${foo}\`␊
        |                                ^^^ Do not use template literal only have one expression.␊
    `

## Invalid #6
      1 | const foo = ""; const bar = `${0, foo}`

> Output

    `␊
      1 | const foo = ""; const bar = (0, foo)␊
    `

> Error 1/1

    `␊
    > 1 | const foo = ""; const bar = \`${0, foo}\`␊
        |                                ^^^^^^ Do not use template literal only have one expression.␊
    `

## Invalid #7
      1 | const foo = ""; const bar = `${(0, foo)}`

> Output

    `␊
      1 | const foo = ""; const bar = (0, foo)␊
    `

> Error 1/1

    `␊
    > 1 | const foo = ""; const bar = \`${(0, foo)}\`␊
        |                                 ^^^^^^ Do not use template literal only have one expression.␊
    `

## Invalid #8
      1 | const foo = ""; const bar = (`${(0, foo)}`)

> Output

    `␊
      1 | const foo = ""; const bar = ((0, foo))␊
    `

> Error 1/1

    `␊
    > 1 | const foo = ""; const bar = (\`${(0, foo)}\`)␊
        |                                  ^^^^^^ Do not use template literal only have one expression.␊
    `

## Invalid #9
      1 | const foo = 1; const bar = `${foo}`

> Output

    `␊
      1 | const foo = 1; const bar = String(foo)␊
    `

> Error 1/1

    `␊
    > 1 | const foo = 1; const bar = \`${foo}\`␊
        |                               ^^^ Do not use template literal only have one expression.␊
    `

## Invalid #10
      1 | const foo = 1; const bar = `${0, foo}`

> Output

    `␊
      1 | const foo = 1; const bar = String((0, foo))␊
    `

> Error 1/1

    `␊
    > 1 | const foo = 1; const bar = \`${0, foo}\`␊
        |                               ^^^^^^ Do not use template literal only have one expression.␊
    `

## Invalid #11
      1 | const foo = 1; const bar = `${(0, foo)}`

> Output

    `␊
      1 | const foo = 1; const bar = String((0, foo))␊
    `

> Error 1/1

    `␊
    > 1 | const foo = 1; const bar = \`${(0, foo)}\`␊
        |                                ^^^^^^ Do not use template literal only have one expression.␊
    `

## Invalid #12
      1 | const foo = 1; const bar = (`${(0, foo)}`)

> Output

    `␊
      1 | const foo = 1; const bar = (String((0, foo)))␊
    `

> Error 1/1

    `␊
    > 1 | const foo = 1; const bar = (\`${(0, foo)}\`)␊
        |                                 ^^^^^^ Do not use template literal only have one expression.␊
    `

## Invalid #1
      1 | `${ 'abc' }`

> Output

    `␊
      1 | \`abc\`␊
    `

> Error 1/1

    `␊
    > 1 | \`${ 'abc' }\`␊
        |     ^^^^^ Do not use string literal as expression.␊
    `

## Invalid #2
      1 | `${ "abc" }`

> Output

    `␊
      1 | \`abc\`␊
    `

> Error 1/1

    `␊
    > 1 | \`${ "abc" }\`␊
        |     ^^^^^ Do not use string literal as expression.␊
    `

## Invalid #3
      1 | `${    (( "abc" ))    }`

> Output

    `␊
      1 | \`abc\`␊
    `

> Error 1/1

    `␊
    > 1 | \`${    (( "abc" ))    }\`␊
        |           ^^^^^ Do not use string literal as expression.␊
    `

## Invalid #4
      1 | `${(( "abc" ))     }`

> Output

    `␊
      1 | \`abc\`␊
    `

> Error 1/1

    `␊
    > 1 | \`${(( "abc" ))     }\`␊
        |       ^^^^^ Do not use string literal as expression.␊
    `

## Invalid #5
      1 | `${    (( "abc" ))}`

> Output

    `␊
      1 | \`abc\`␊
    `

> Error 1/1

    `␊
    > 1 | \`${    (( "abc" ))}\`␊
        |           ^^^^^ Do not use string literal as expression.␊
    `

## Invalid #6
      1 | `${ "\"\uFFeF\"" }`

> Output

    `␊
      1 | \`"\\uFFeF"\`␊
    `

> Error 1/1

    `␊
    > 1 | \`${ "\\"\\uFFeF\\"" }\`␊
        |     ^^^^^^^^^^^^ Do not use string literal as expression.␊
    `

## Invalid #7
      1 | `${ "\\\"\uFFeF\\\"" }`

> Output

    `␊
      1 | \`\\\\"\\uFFeF\\\\"\`␊
    `

> Error 1/1

    `␊
    > 1 | \`${ "\\\\\\"\\uFFeF\\\\\\"" }\`␊
        |     ^^^^^^^^^^^^^^^^ Do not use string literal as expression.␊
    `

## Invalid #8
      1 | `${ "\\\\\"\uFFeF\\\\\"" }`

> Output

    `␊
      1 | \`\\\\\\\\"\\uFFeF\\\\\\\\"\`␊
    `

> Error 1/1

    `␊
    > 1 | \`${ "\\\\\\\\\\"\\uFFeF\\\\\\\\\\"" }\`␊
        |     ^^^^^^^^^^^^^^^^^^^^ Do not use string literal as expression.␊
    `

## Invalid #9
      1 | `${ '\'\uFFeF\'' }`

> Output

    `␊
      1 | \`'\\uFFeF'\`␊
    `

> Error 1/1

    `␊
    > 1 | \`${ '\\'\\uFFeF\\'' }\`␊
        |     ^^^^^^^^^^^^ Do not use string literal as expression.␊
    `

## Invalid #10
      1 | `${ '\\\'\uFFeF\\\'' }`

> Output

    `␊
      1 | \`\\\\'\\uFFeF\\\\'\`␊
    `

> Error 1/1

    `␊
    > 1 | \`${ '\\\\\\'\\uFFeF\\\\\\'' }\`␊
        |     ^^^^^^^^^^^^^^^^ Do not use string literal as expression.␊
    `

## Invalid #11
      1 | `${ '\\\\\'\uFFeF\\\\\'' }`

> Output

    `␊
      1 | \`\\\\\\\\'\\uFFeF\\\\\\\\'\`␊
    `

> Error 1/1

    `␊
    > 1 | \`${ '\\\\\\\\\\'\\uFFeF\\\\\\\\\\'' }\`␊
        |     ^^^^^^^^^^^^^^^^^^^^ Do not use string literal as expression.␊
    `

## Invalid #12
      1 | `${ "${\"``}" }`

> Output

    `␊
      1 | \`\\${"\\\`\\\`}\`␊
    `

> Error 1/1

    `␊
    > 1 | \`${ "${\\"\`\`}" }\`␊
        |     ^^^^^^^^^ Do not use string literal as expression.␊
    `
